EEESlab/mobilenet_v1_stm32_cmsis_nn/Src/main.c
		/*Layer 10	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV10_IM_DIM, CONV10_IM_CH,
								  conv10_wt, CONV10_W_Z, CONV10_IN_Z, CONV10_OUT_Z, CONV10_M_ZERO, CONV10_N_ZERO,
								  CONV10_OUT_CH, CONV10_KER_DIM,
								  CONV10_L_PADDING, CONV10_R_PADDING, CONV10_T_PADDING, CONV10_B_PADDING, CONV10_STRIDE, conv10_bias,
								  tensorOut, CONV10_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV11_OUT_DIM*CONV11_OUT_DIM*CONV11_OUT_CH);
		tensorId = !tensorId;

		/*Layer 11	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV11_IM_DIM, CONV11_IM_CH,
									  conv11_wt, CONV11_W_Z, CONV11_IN_Z, CONV11_OUT_Z, CONV11_M_ZERO, CONV11_N_ZERO,
									  CONV11_OUT_CH, CONV11_KER_DIM,
									  CONV11_L_PADDING, CONV11_R_PADDING, CONV11_T_PADDING, CONV11_B_PADDING, CONV11_STRIDE, conv11_bias,
									  tensorOut, CONV11_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV12_OUT_DIM*CONV12_OUT_DIM*CONV12_OUT_CH);
		tensorId = !tensorId;

		/*Layer 12	Conv dw/ s2
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV12_IM_DIM, CONV12_IM_CH,
									  conv12_wt, CONV12_W_Z, CONV12_IN_Z, CONV12_OUT_Z, CONV12_M_ZERO, CONV12_N_ZERO,
									  CONV12_OUT_CH, CONV12_KER_DIM,
									  CONV12_L_PADDING, CONV12_R_PADDING, CONV12_T_PADDING, CONV12_B_PADDING, CONV12_STRIDE, conv12_bias,
									  tensorOut, CONV12_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV13_OUT_DIM*CONV13_OUT_DIM*CONV13_OUT_CH);
		tensorId = !tensorId;

		/*Layer 13	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV13_IM_DIM, CONV13_IM_CH,
									  conv13_wt, CONV13_W_Z, CONV13_IN_Z, CONV13_OUT_Z, CONV13_M_ZERO, CONV13_N_ZERO,
									  CONV13_OUT_CH, CONV13_KER_DIM,
									  CONV13_L_PADDING, CONV13_R_PADDING, CONV13_T_PADDING, CONV13_B_PADDING, CONV13_STRIDE, conv13_bias,
									  tensorOut, CONV13_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV14_OUT_DIM*CONV14_OUT_DIM*CONV14_OUT_CH);
		tensorId = !tensorId;

		/*Layer 14	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV14_IM_DIM, CONV14_IM_CH,
									  conv14_wt, CONV14_W_Z, CONV14_IN_Z, CONV14_OUT_Z, CONV14_M_ZERO, CONV14_N_ZERO,
									  CONV14_OUT_CH, CONV14_KER_DIM,
									  CONV14_L_PADDING, CONV14_R_PADDING, CONV14_T_PADDING, CONV14_B_PADDING, CONV14_STRIDE, conv14_bias,
									  tensorOut, CONV14_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV15_OUT_DIM*CONV15_OUT_DIM*CONV15_OUT_CH);
		tensorId = !tensorId;

		/*Layer 15	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV15_IM_DIM, CONV15_IM_CH,
									  conv15_wt, CONV15_W_Z, CONV15_IN_Z, CONV15_OUT_Z, CONV15_M_ZERO, CONV15_N_ZERO,
									  CONV15_OUT_CH, CONV15_KER_DIM,
									  CONV15_L_PADDING, CONV15_R_PADDING, CONV15_T_PADDING, CONV15_B_PADDING, CONV15_STRIDE, conv15_bias,
									  tensorOut, CONV15_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV16_OUT_DIM*CONV16_OUT_DIM*CONV16_OUT_CH);
		tensorId = !tensorId;

		/*Layer 16	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV16_IM_DIM, CONV16_IM_CH,
									  conv16_wt, CONV16_W_Z, CONV16_IN_Z, CONV16_OUT_Z, CONV16_M_ZERO, CONV16_N_ZERO,
									  CONV16_OUT_CH, CONV16_KER_DIM,
									  CONV16_L_PADDING, CONV16_R_PADDING, CONV16_T_PADDING, CONV16_B_PADDING, CONV16_STRIDE, conv16_bias,
									  tensorOut, CONV16_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV17_OUT_DIM*CONV17_OUT_DIM*CONV17_OUT_CH);
		tensorId = !tensorId;

		/*Layer 17	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV17_IM_DIM, CONV17_IM_CH,
									  conv17_wt, CONV17_W_Z, CONV17_IN_Z, CONV17_OUT_Z, CONV17_M_ZERO, CONV17_N_ZERO,
									  CONV17_OUT_CH, CONV17_KER_DIM,
									  CONV17_L_PADDING, CONV17_R_PADDING, CONV17_T_PADDING, CONV17_B_PADDING, CONV17_STRIDE, conv17_bias,
									  tensorOut, CONV17_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV18_OUT_DIM*CONV18_OUT_DIM*CONV18_OUT_CH);
		tensorId = !tensorId;

		/*Layer 18	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV18_IM_DIM, CONV18_IM_CH,
									  conv18_wt, CONV18_W_Z, CONV18_IN_Z, CONV18_OUT_Z, CONV18_M_ZERO, CONV18_N_ZERO,
									  CONV18_OUT_CH, CONV18_KER_DIM,
									  CONV18_L_PADDING, CONV18_R_PADDING, CONV18_T_PADDING, CONV18_B_PADDING, CONV18_STRIDE, conv18_bias,
									  tensorOut, CONV18_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV19_OUT_DIM*CONV19_OUT_DIM*CONV19_OUT_CH);
		tensorId = !tensorId;

		/*Layer 19	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV19_IM_DIM, CONV19_IM_CH,
									  conv19_wt, CONV19_W_Z, CONV19_IN_Z, CONV19_OUT_Z, CONV19_M_ZERO, CONV19_N_ZERO,
									  CONV19_OUT_CH, CONV19_KER_DIM,
									  CONV19_L_PADDING, CONV19_R_PADDING, CONV19_T_PADDING, CONV19_B_PADDING, CONV19_STRIDE, conv19_bias,
									  tensorOut, CONV19_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV20_OUT_DIM*CONV20_OUT_DIM*CONV20_OUT_CH);
		tensorId = !tensorId;

		/*Layer 20	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV20_IM_DIM, CONV20_IM_CH,
									  conv20_wt, CONV20_W_Z, CONV20_IN_Z, CONV20_OUT_Z, CONV20_M_ZERO, CONV20_N_ZERO,
									  CONV20_OUT_CH, CONV20_KER_DIM,
									  CONV20_L_PADDING, CONV20_R_PADDING, CONV20_T_PADDING, CONV20_B_PADDING, CONV20_STRIDE, conv20_bias,
									  tensorOut, CONV20_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV21_OUT_DIM*CONV21_OUT_DIM*CONV21_OUT_CH);
		tensorId = !tensorId;

		/*Layer 21	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV21_IM_DIM, CONV21_IM_CH,
									  conv21_wt, CONV21_W_Z, CONV21_IN_Z, CONV21_OUT_Z, CONV21_M_ZERO, CONV21_N_ZERO,
									  CONV21_OUT_CH, CONV21_KER_DIM,
									  CONV21_L_PADDING, CONV21_R_PADDING, CONV21_T_PADDING, CONV21_B_PADDING, CONV21_STRIDE, conv21_bias,
									  tensorOut, CONV21_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV22_OUT_DIM*CONV22_OUT_DIM*CONV22_OUT_CH);
		tensorId = !tensorId;

