EEESlab/mobilenet_v1_stm32_cmsis_nn/Src/main.c
		/*Layer 22	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV22_IM_DIM, CONV22_IM_CH,
									  conv22_wt, CONV22_W_Z, CONV22_IN_Z, CONV22_OUT_Z, CONV22_M_ZERO, CONV22_N_ZERO,
									  CONV22_OUT_CH, CONV22_KER_DIM,
									  CONV22_L_PADDING, CONV22_R_PADDING, CONV22_T_PADDING, CONV22_B_PADDING, CONV22_STRIDE, conv22_bias,
									  tensorOut, CONV22_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV23_OUT_DIM*CONV23_OUT_DIM*CONV23_OUT_CH);
		tensorId = !tensorId;

		/*Layer 23	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV23_IM_DIM, CONV23_IM_CH,
									  conv23_wt, CONV23_W_Z, CONV23_IN_Z, CONV23_OUT_Z, CONV23_M_ZERO, CONV23_N_ZERO,
									  CONV23_OUT_CH, CONV23_KER_DIM,
									  CONV23_L_PADDING, CONV23_R_PADDING, CONV23_T_PADDING, CONV23_B_PADDING, CONV23_STRIDE, conv23_bias,
									  tensorOut, CONV23_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV24_OUT_DIM*CONV24_OUT_DIM*CONV24_OUT_CH);
		tensorId = !tensorId;

		/*Layer 24	Conv dw/ s2
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV24_IM_DIM, CONV24_IM_CH,
									  conv24_wt, CONV24_W_Z, CONV24_IN_Z, CONV24_OUT_Z, CONV24_M_ZERO, CONV24_N_ZERO,
									  CONV24_OUT_CH, CONV24_KER_DIM,
									  CONV24_L_PADDING, CONV24_R_PADDING, CONV24_T_PADDING, CONV24_B_PADDING, CONV24_STRIDE, conv24_bias,
									  tensorOut, CONV24_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV25_OUT_DIM*CONV25_OUT_DIM*CONV25_OUT_CH);
		tensorId = !tensorId;

		/*Layer 25	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV25_IM_DIM, CONV25_IM_CH,
									  conv25_wt, CONV25_W_Z, CONV25_IN_Z, CONV25_OUT_Z, CONV25_M_ZERO, CONV25_N_ZERO,
									  CONV25_OUT_CH, CONV25_KER_DIM,
									  CONV25_L_PADDING, CONV25_R_PADDING, CONV25_T_PADDING, CONV25_B_PADDING, CONV25_STRIDE, conv25_bias,
									  tensorOut, CONV25_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV26_OUT_DIM*CONV26_OUT_DIM*CONV26_OUT_CH);
		tensorId = !tensorId;

		/*Layer 26	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_uint8_asym(tensorIn, CONV26_IM_DIM, CONV26_IM_CH,
									  conv26_wt, CONV26_W_Z, CONV26_IN_Z, CONV26_OUT_Z, CONV26_M_ZERO, CONV26_N_ZERO,
									  CONV26_OUT_CH, CONV26_KER_DIM,
									  CONV26_L_PADDING, CONV26_R_PADDING, CONV26_T_PADDING, CONV26_B_PADDING, CONV26_STRIDE, conv26_bias,
									  tensorOut, CONV26_OUT_DIM, l1_tensor_scratch, NULL);
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV27_OUT_DIM*CONV27_OUT_DIM*CONV27_OUT_CH);
		tensorId = !tensorId;

		/*Layer 27	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_uint8_asym_fast(tensorIn, CONV27_IM_DIM, CONV27_IM_CH,
									  conv27_wt, CONV27_W_Z, CONV27_IN_Z, CONV27_OUT_Z, CONV27_M_ZERO, CONV27_N_ZERO,
									  CONV27_OUT_CH, CONV27_KER_DIM,
									  CONV27_L_PADDING, CONV27_R_PADDING, CONV27_T_PADDING, CONV27_B_PADDING, CONV27_STRIDE, conv27_bias,
									  tensorOut, CONV27_OUT_DIM, l1_tensor_scratch, NULL);

		USR_MEM_BARRIER();
		cpu_cycles[1] = USR_CC_TIMESTAMP();
		USR_MEM_BARRIER();

	}
  return 0;
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Supply configuration update enable
    */
  MODIFY_REG(PWR->CR3, PWR_CR3_SCUEN, 0);

    /**Configure the main internal regulator output voltage
    */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while ((PWR->D3CR & (PWR_D3CR_VOSRDY)) != PWR_D3CR_VOSRDY)
  {

  }
    /**Initializes the CPU, AHB and APB busses clocks
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 96;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time
    */
  HAL_SYSTICK_Config(SystemCoreClock/1000);

    /**Configure the Systick
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** Configure pins as
        * Analog
        * Input
        * Output
        * EVENT_OUT
        * EXTI
        * Free pins are configured automatically as Analog (this feature is enabled through
        * the Code Generation settings)
     PC1   ------> ETH_MDC
     PA1   ------> ETH_REF_CLK
     PA2   ------> ETH_MDIO
     PA7   ------> ETH_CRS_DV
     PC4   ------> ETH_RXD0
     PC5   ------> ETH_RXD1
     PB13   ------> ETH_TXD1
     PD8   ------> USART3_TX
     PD9   ------> USART3_RX
     PA8   ------> USB_OTG_FS_SOF
     PA10   ------> USB_OTG_FS_ID
     PA11   ------> USB_OTG_FS_DM
     PA12   ------> USB_OTG_FS_DP
     PG11   ------> ETH_TX_EN
     PG13   ------> ETH_TXD0
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, LD3_Pin|LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(USB_PowerSwitchOn_GPIO_Port, USB_PowerSwitchOn_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : PE2 PE3 PE4 PE5
                           PE6 PE7 PE8 PE9
                           PE10 PE11 PE12 PE13
                           PE14 PE15 PE0 PE1 */
  GPIO_InitStruct.Pin = GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5
                          |GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9
                          |GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13
                          |GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_0|GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

